#6. Дано список кортежів grades = [( "Алла 4), (" Борис 2), ( "Катерина 3), (" Денис 5)].
# Вивести на екран послідовність повідомлень виду "Вітаю, Алла! Ваша оцінка - 4".

grades = [( "Алла", 4), ("Борис",2), ( "Катерина", 3), ("Денис", 5)]

for i in grades:
    name,points=i 
    print("Вітаю, {0}! Ваша оцінка - {1}".format(name,points))