#18. Дано ціле число N (> 0). Використовуючи операції ділення без остачі і взяття залишку від ділення, 
#   вивести всі його цифри, починаючи з самої правої (розряду одиниць).

n=int(input("Введите целое число   "))
print("Цирфы числа (справа налево):")

while n>0:
    c=n%10
    n//=10
    print(' ',c)
