#7. Одиниці маси пронумеровані в такий спосіб: 1 - кілограм, 2 - міліграм, 3 - грам, 4 - тонна, 5 - центнер. 
#   Дано номер одиниці маси (ціле число в діапазоні 1-5) і маса тіла в цих одиницях (дійсне число). Знайти масу тіла в кілограмах.
mas=float(input("Введите массу:  "))
num=int(input("Введите номер еденицы массы (1 - килограмм, 2 - милиграмм, 3 - грамм, 4 - тонна, 5 - центнер):  "))
res=0

if num==1:
    res=mas
elif num==2:
    res=mas*10**-6
elif num==3:
    res=mas*10**-3
elif num==4:
    res=mas*1000
elif num==5:
    res=mas*100
else:
    print("Неправильная еденица массы")

print(res," кг")