#17. Швидкість першого автомобіля V1 км/год, другого - V2 км/год, відстань між ними S км. 
#    Визначити відстань між ними через T годин, якщо автомобілі спочатку рухаються назустріч один одному. 
#    Дана відстань рівна модулю різниці початкової відстані і загального шляху, пройденого автомобілями; загальний шлях = час · сумарна швидкість.

v1=40; v2=15; s=120
t=9

#the distance between cars after t hours
s=abs(s-t*(v1+v2))
print("The distance between cars after {0} hours is {1} km".format(t,s))
