#2. Дана сторона квадрата a. Знайти його площу S=a2.
a=int(input("Введите сторону квадрата:   "))
a=a**2
print("Площадь квадрата = ", a)
