 #Дана монотонна послідовність, в якій кожне натуральне число k зустрічається рівно k раз:
 # 1, 2, 2, 3, 3, 3, 4, 4, 4, 4, ... За даним натуральному n виведіть перші n членів цієї 
 # послідовності . Спробуйте обійтися тільки одним циклом for.

n=int(input("Введите количество элементов n:"))
numb=1

for i in range(1,n+1):
    print(i,":\t",numb)

    if i==numb*(numb+1)//2:
        numb+=1


#print((str(i)+" ")*i)
# 1 3 6 10 15 