#12. Дана послідовність натуральних чисел (одне число в рядку), що завершується числом 0.
# Виведіть перше, третє, п'яте і т.д. з введених чисел. Завершальний нуль виводити не потрібно


print("Введите числа через ENTER ")
i=0
def task():
    global i
    a=int(input())
    if a!=0:
        i+=1
        if (i%2!=0):
            print("Число №{0}:    {1}".format(i,a))
        task()
    else:
        return

task()
